Public Attributes | List of all members
API_PrimElemRef Struct Reference
Geometry
Primitive element reference. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Guid  | guid
Guid of the referenced element.
 API_ElemType  | type
Type of the referenced element.
 short  | drwIndex
Drawing order index of the referenced element.
Detailed Description
Primitive element reference.
Since
Archicad 26
Remarks
Primitive element references can be passed e.g. for windows and doors, where they refer to the owning wall. From version 26 the type of the typeID member was changed into API_ElemType.